# DataFrame

In [1]:
import pandas as pd

In [2]:
import pandas as pd 

data = {
    "Name":["Deepak","Ankit","Rahul"],
    "age" :[20,23,25],
    "salary" :[30000,25000,24000]
}

d = pd.DataFrame(data)

print(d)

     Name  age  salary
0  Deepak   20   30000
1   Ankit   23   25000
2   Rahul   25   24000

In [3]:
import pandas as pd 

data = {
    "Name":["Deepak","Ankit","Rahul"],
    "age" :[20,23,25],
    "salary" :[30000,25000,24000]
}

d = pd.DataFrame(data)

data.update({"experience" :[2,4,"fresher"]})
d = pd.DataFrame(data)

print(d)

     Name  age  salary experience
0  Deepak   20   30000          2
1   Ankit   23   25000          4
2   Rahul   25   24000    fresher

<!-- install openpyxl - read excel file -->

# Read Excel file:   .read_excel("File.xlsx")

In [4]:
data = pd.read_excel("student.xlsx")            #Read excel file using .read_excel("File_name.extension")

print(data)

     ID    Name   Age Course
0   101  Deepak    19    Bca
1   102    Ankit   23    Bca
2   103    Rahul   24    Bca
3   104     Yash   21    Bca
4   105  Elvish    22  Bcom
5   106  Lakshay   16  Btech
6   107    Rajat   20    Bsc
7   108   Naveen   23  Btech
8   109    Mohit   22     Ba
9   110    Shyam   20    Bca
10  105  Elvish    22  Bcom

# data.info() = show all  information of the data

In [5]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      11 non-null     int64
 1   Name    11 non-null     object
 2   Age     11 non-null     int64
 3   Course  11 non-null     object
dtypes: int64(2), object(2)
memory usage: 484.0+ bytes
None

# data.describe()

In [6]:
data.describe()

               ID        Age
count   11.000000  11.000000
mean   105.454545  21.090909
std      2.876235   2.256304
min    101.000000  16.000000
25%    103.500000  20.000000
50%    105.000000  22.000000
75%    107.500000  22.500000
max    110.000000  24.000000

In [7]:
# if excel file is long 100 1nd 1000  row the python has show the 5 starting row1,row2,row3.........row997,ro998,row999

# python ny default show 5 row of data 

# if you read abobe 5 row to use -- 
# data.head(10)
# data.head(8)

# if you read 990 to 1000 number of row to use :-

# data.tail(10)

In [8]:
data = pd.read_excel("student.xlsx")            

print(data)

     ID    Name   Age Course
0   101  Deepak    19    Bca
1   102    Ankit   23    Bca
2   103    Rahul   24    Bca
3   104     Yash   21    Bca
4   105  Elvish    22  Bcom
5   106  Lakshay   16  Btech
6   107    Rajat   20    Bsc
7   108   Naveen   23  Btech
8   109    Mohit   22     Ba
9   110    Shyam   20    Bca
10  105  Elvish    22  Bcom

# data["column_name"].duplicated()    return duplicate value -True

In [9]:
# data["column_name"].duplicated()

data = pd.read_excel("student.xlsx")            

print(data)
print(data["ID"].duplicated())

     ID    Name   Age Course
0   101  Deepak    19    Bca
1   102    Ankit   23    Bca
2   103    Rahul   24    Bca
3   104     Yash   21    Bca
4   105  Elvish    22  Bcom
5   106  Lakshay   16  Btech
6   107    Rajat   20    Bsc
7   108   Naveen   23  Btech
8   109    Mohit   22     Ba
9   110    Shyam   20    Bca
10  105  Elvish    22  Bcom
0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
Name: ID, dtype: bool

# data["column_name"].duplicated().sum()       |||||       .sum()   return how many duplicate value

In [10]:
data = pd.read_excel("student.xlsx")

print(data)

print(data["ID"].duplicated().sum())

     ID    Name   Age Course
0   101  Deepak    19    Bca
1   102    Ankit   23    Bca
2   103    Rahul   24    Bca
3   104     Yash   21    Bca
4   105  Elvish    22  Bcom
5   106  Lakshay   16  Btech
6   107    Rajat   20    Bsc
7   108   Naveen   23  Btech
8   109    Mohit   22     Ba
9   110    Shyam   20    Bca
10  105  Elvish    22  Bcom
1

# data.drop_duplicates("column_name")           

remove duplacte value

In [11]:
print(data.drop_duplicates("ID"))

    ID    Name   Age Course
0  101  Deepak    19    Bca
1  102    Ankit   23    Bca
2  103    Rahul   24    Bca
3  104     Yash   21    Bca
4  105  Elvish    22  Bcom
5  106  Lakshay   16  Btech
6  107    Rajat   20    Bsc
7  108   Naveen   23  Btech
8  109    Mohit   22     Ba
9  110    Shyam   20    Bca

# Work emplyee data

In [12]:
data = pd.read_excel("employee.xlsx")
print(data)

    ID    Name    Age   salary
0  101  Deepak   19.0  25000.0
1  102    Ankit  23.0      NaN
2  103    Rahul  24.0  15000.0
3  104     Yash   NaN  20000.0
4  105  Elvish   22.0  24000.0

# .isnull()   return null values(true)

In [13]:
print(data.isnull())

      ID  Name     Age  salary
0  False  False  False   False
1  False  False  False    True
2  False  False  False   False
3  False  False   True   False
4  False  False  False   False

# isnull().sum()       return how many amd whatever null value

In [14]:
print(data.isnull().sum())

ID        0
Name      0
Age       1
salary    1
dtype: int64

In [15]:
print(data)

    ID    Name    Age   salary
0  101  Deepak   19.0  25000.0
1  102    Ankit  23.0      NaN
2  103    Rahul  24.0  15000.0
3  104     Yash   NaN  20000.0
4  105  Elvish   22.0  24000.0

# fill null vlues

data["column"] = data["column"].replace(numpy.nan,value)

In [16]:
import numpy as np

# data["salary"] = data["salary"].replace(np.nan,17000)
# print(data)

In [17]:
# fill mean values

print(data["salary"].mean())

21000.0

In [18]:
data["salary"] = data["salary"].replace(np.nan,21000)
print(data)

    ID    Name    Age   salary
0  101  Deepak   19.0  25000.0
1  102    Ankit  23.0  21000.0
2  103    Rahul  24.0  15000.0
3  104     Yash   NaN  20000.0
4  105  Elvish   22.0  24000.0

In [19]:
print(data["salary"].mean())

21000.0

In [20]:
print(data.fillna("Hi"))

    ID    Name    Age   salary
0  101  Deepak   19.0  25000.0
1  102    Ankit  23.0  21000.0
2  103    Rahul  24.0  15000.0
3  104     Yash    Hi  20000.0
4  105  Elvish   22.0  24000.0

# column transformation

In [31]:
data  =pd.read_excel("emp2.xlsx")
print(data)

# frist 
# data["full name"]  = data["first name"] + " " + data["last name"]
# print(data)

    ID first name  last name  Age  salary
0  101     Deepak      gupta   19   25000
1  102       Ankit      jaat   23   20000
2  103       Rahul      garg   24   15000
3  104        Yash    sharma   20   20000
4  105     Elvish      yadav   22   24000

In [36]:
data["Bonus"] =data["salary"]*0.20
print(data)

data["Total salary"] = data["salary"] +  data["salary"]*0.20

    ID first name  last name  Age  salary   Bonus  Total salary
0  101     Deepak      gupta   19   25000  5000.0       30000.0
1  102       Ankit      jaat   23   20000  4000.0       24000.0
2  103       Rahul      garg   24   15000  3000.0       18000.0
3  104        Yash    sharma   20   20000  4000.0       24000.0
4  105     Elvish      yadav   22   24000  4800.0       28800.0